#include <stdio.h>

int main ()
 { float r,g,b,h,s,v,max,min;
   printf(" Введите ,пожалуйста ,R,G,B ([0,255])\n");
   scanf("%f %f %f",&r,&g,&b);
   r=r/255; //учитываем что RGB в формулах [0,1]
   g=g/255; 
   b=b/255; 
if ((b==g)&&(g==r))
    { h=0;
      max=r;
      min=r;
        }
   if ((r>b)&&(r>g)&&(g>=b))
    { max=r; 
      min=b;
      h=60*(g-b)/(max-min);}
  if ((r>b)&&(r>g)&&(g<b))
    { max=r;
      min=g;
      h=60*(g-b)/(max-min) +360;}
  if ((g>b)&&(g>r)&&(b>=r))
   { max=g;
     min=r;
    h=(b-r)/(max-min)+120;}
  if ((g>b)&&(g>r)&&(r>b))
   { max=g;
     min=b;
     h=(b-r)/(max-min)+120;
   } 
  if ((b>g)&&(b>r)&&(g>=r))
   { max=b;
     min=r;
     h=(g-r)/(max-min)+240;
    printf ("%f \n",h);
    }
  if ((b>g)&&(b>r)&&(r>g))
   { max=b;
     min=g;
     h=(g-b)/(max-min)+240;
    }
   
   if (max!=0) {s=1-(min/max);}
   else {s=0;}
   v=max;
printf ("H=%.3f S=%.3f V=%.3f \n",h,s,v);
if ((h>=0)&&(h<=360)&&(s>=0)&&(s<=1)&&(v<=0.10)) printf("Цвет примерно черный \n");
if ((h>=0)&&(h<=360)&&(s<=0.15)&&(v>=0.65)) printf("Цвет примерно белый \n");
if ((h>=0)&&(h<=360)&&(s<=0.15)&&(v>=0.10)&&(v<=0.65)) printf("Цвет примерно серый \n");
if ((h<=11) && (h>=351) && (s>=0.70) && (v>=0.10)) printf("Цвет примерно красный\n");
if ((h<=11)&&(h>=351)&&(s<=0.70)&&(v>=0.10))  printf("Цвет примерно розовый\n");
if ((310<=h)&&(h<=351)&&(s>=0.15)&&(v>=0.10)) printf("Цвет примерно розовый \n");
if ((11<=h)&&(h<=45)&&(s>=0.15)&&(v>=0.75))  printf("Цвет примерно оранжевый \n");
if ((11<=h)&&(h<=45)&&(s>=0.15)&&(0.10<=v)&&(v<=0.75)) printf("Цвет примерно коричневый\n");
if ((45<=h)&&(h<=0.64)&&(s>=0.15)&&(v>=0.10)) printf("Цвет примерно желтый \n");
if ((64<=h)&&(h<=150)&&(s>=0.15)&&(v>=0.10)) printf("Цвет примерно зеленый \n");
if ((150<=h)&&(h<=180)&&(s>=0.15)&&(v>=0.10)) printf("Цвет примерно сине-зеленый\n");
if ((180<=h)&&(h<=255)&&(s>=0.15)&&(v>=0.10)) printf("Цвет примерно синий\n");
if ((255<=h)&&(h<=310)&&(s>=0.50)&&(v>=0.10)) printf("Цвет примерно фиолетовый\n");
if ((255<=h)&&(h<=310)&&(0.15<=s)&&(s<=0.50)&&(v>=0.10)) printf("Цвет примерно темно-розовый\n");
 return 0;
}
   
 
       
  
