#include <stdio.h>
//#include <>

int main ()
{  int i,d;
  printf ("В данной программе вы можете выполнять действия с телефонной книге \n");
  printf ("Список всех действий и то , как их вызвать , представленны ниже : \n"); 
  printf ("  Чтобы вызвать весь список контактов , нажмите 1 , затем Enter \n");
  printf ("  Чтобы добавить контакт , нажмите 2 , затем Enter \n");
  printf ("  Чтобы удалить контакт , нажмите 3, затем Enter \n");
  printf ("  Чтобы найти контакт , нажмите 4  , затем Enter \n"); 
  printf ("  Чтобы выйти из программы , нажмите 5 , затем Enter \n");


 scanf("%d",&d);
  
  // if (d==1) 
   
   
    


return 0;
   }
